nakhonthai/ESP32APRS_LoRa/src/main.cpp
/*
 Name:		ESP32APRS LoRa
 Created:	1-Feb-2024
 Author:	HS5TQA/Atten
 Support IS: host:aprs.dprns.com port:14580
 Support IS monitor: http://aprs.dprns.com:14501
 Support in LINE Group APRS Only
*/

#include <Arduino.h>
#include <esp_task_wdt.h>
#include "main.h"
#include <LibAPRSesp.h>
#include <limits.h>
#include <KISS.h>
#include "webservice.h"
#include <WiFiUdp.h>
#include "ESP32Ping.h"
#include <WiFi.h>
#include <WiFiMulti.h>
#include <WiFiClient.h>
#include "cppQueue.h"
#include "digirepeater.h"
#include "igate.h"
#include "wireguardif.h"
#include "wireguard.h"
#include "driver/pcnt.h"

#include "driver/adc.h"
#include "esp_adc_cal.h"

// #include "driver/temp_sensor.h"

#include <TinyGPS++.h>
#include <pbuf.h>
#include <parse_aprs.h>
#include <Fonts/FreeSansBold9pt7b.h>
#include <Fonts/FreeSerifItalic9pt7b.h>
#include <Fonts/Seven_Segment24pt7b.h>

#include "wireguard_vpn.h"
#include <WiFiUdp.h>

#include <WiFiClientSecure.h>

#include <SoftwareSerial.h>
// SoftwareSerial ss(-1, -1);

#include <ModbusMaster.h>

#include <EEPROM.h>

#include "IP5306_I2C.h"

#include "sensor.h"

#include <rom/spi_flash.h>
#include "FS.h"
#include <LITTLEFS.h>

#include <time.h>

// #include <PPPoS.h>
#ifdef TTGO_T_Beam_S3_SUPREME_V3
#include <XPowersLib.h>
#define PMU_I2C_SDA (42)
#define PMU_I2C_SCL (41)
#define PMU_IRQ (40)
XPowersAXP2101 PMU;
#endif

#ifdef TTGO_T_Beam_V1_2
#include <XPowersLib.h>
#define PMU_I2C_SDA (21)
#define PMU_I2C_SCL (22)
#define PMU_IRQ (35)
XPowersAXP2101 PMU;
#endif

#define EEPROM_SIZE 4096

#ifdef BLUETOOTH
#include "BluetoothSerial.h"
#endif

bool i2c_busy = false;
#include <Wire.h>
#ifdef OLED
#include "Adafruit_SSD1306.h"
#include <Adafruit_GFX.h>
#include <Adafruit_I2CDevice.h>

#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels
// Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
#ifdef TTGO_LORA32_V1
#define OLED_RESET 16 // Reset pin # (or -1 if sharing Arduino reset pin)
#else
#define OLED_RESET -1
#endif
#define SCREEN_ADDRESS 0x3D ///< See datasheet for Address; 0x3D for 128x64, 0x3C for 128x32
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

#endif

// #define LED_TX -1
#define LED_RX -1

#ifdef ST7735_160x80
#include <Adafruit_GFX.h>    // Core graphics library
#include <Adafruit_ST7735.h> // Hardware-specific library for ST7735
#include "Adafruit_miniTFTWing.h"

// SPIClass hspi;
Adafruit_miniTFTWing ss;

#define BLACK ST77XX_BLACK
#define WHITE ST77XX_WHITE

/* Heltec Wireless Tracker V1.1 */

//
// TFT data from HT_st7735.h
//
#define ST7735_CS_Pin 38
#define ST7735_REST_Pin 39
#define ST7735_DC_Pin 40
#define ST7735_SCLK_Pin 41
#define ST7735_MOSI_Pin 42
#define ST7735_LED_K_Pin 21
#define ST7735_VTFT_CTRL_Pin 3
#define ST7735_WIDTH 160
#define ST7735_HEIGHT 80
// mini 160x80, rotate left (INITR_MINI160x80_PLUGIN)
#define ST7735_MODEL INITR_MINI160x80_PLUGIN

SPIClass TFT_SPI(HSPI);
// class Adafruit_ST7735{
//     public:
//       void clearDisplay();
//       void display();
// };

// void Adafruit_ST7735::clearDisplay()
// {
//     fillScreen(ST77XX_BLACK);
// }

// void Adafruit_ST7735::display()
// {
//     delay(1);
// }

// Adafruit_ST7735 display = Adafruit_ST7735(ST7735_CS_Pin,  ST7735_DC_Pin,ST7735_MOSI_Pin,ST7735_SCLK_Pin, ST7735_REST_Pin);
Adafruit_ST7735 display = Adafruit_ST7735(&TFT_SPI, ST7735_CS_Pin, ST7735_DC_Pin, ST7735_REST_Pin);

#define LED_TX -1
#else
#define LED_TX -1
#endif

#define FORMAT_LITTLEFS_IF_FAILED true
extern fs::LITTLEFSFS LITTLEFS;

struct pbuf_t aprs;
ParseAPRS aprsParse;

TinyGPSPlus gps;

// instantiate ModbusMaster object
ModbusMaster modbus;

#define VBAT_PIN 35

#define PPP_APN "internet"
#define PPP_USER ""
#define PPP_PASS ""

#ifdef __XTENSA__
#define BOOT_PIN 0
#else
#define BOOT_PIN 9
#endif

const char *str_status[] = {
    "IDLE_STATUS",
    "NO_SSID_AVAIL",
    "SCAN_COMPLETED",
    "CONNECTED",
    "CONNECT_FAILED",
    "CONNECTION_LOST",
    "DISCONNECTED"};

// PPPoS ppp;

WiFiMulti wifiMulti;

time_t systemUptime = 0;
time_t wifiUptime = 0;

uint8_t Sleep_Activate = 0;
unsigned long StandByTick = 0;

bool lastHeard_Flag = 0;

RTC_DATA_ATTR bool gps_mode;

boolean KISS = false;
bool aprsUpdate = false;

long timeSleep = 0;

boolean gotPacket = false;
AX25Msg incomingPacket;

bool lastPkg = false;
bool afskSync = false;
String lastPkgRaw = "";
// float dBV = 0;
// float dBm = 0;
// int mVrms = 0;
float rssi = 0;
float snr = 0;
float freqErr = 0;

long timeNetwork, timeAprs, timeGui;

cppQueue PacketBuffer(sizeof(AX25Msg), 5, IMPLEMENTATION); // Instantiate queue
#if defined OLED || defined ST7735_160x80
cppQueue dispBuffer(300, 5, IMPLEMENTATION);
cppQueue queTxDisp(sizeof(txDisp), 5, IMPLEMENTATION); // Instantiate queue

void pushTxDisp(uint8_t ch, const char *name, char *info)
{
    if (!config.tx_display)
        return;

    size_t name_len = strlen(name);
    size_t info_len = strlen(info);
    if ((name_len > 1 && name_len < 12) && (info_len > 1 && info_len < 50))
    {
        txDisp pkg;
        pkg.tx_ch = ch;
        memset(pkg.name, 0, 12);
        memset(pkg.info, 0, 50);
        strncpy(pkg.name, name, name_len);
        strncpy(pkg.info, info, info_len);
        queTxDisp.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
    }
}
#endif

statusType status;
RTC_DATA_ATTR igateTLMType igateTLM;
RTC_DATA_ATTR dataTLMType systemTLM;
txQueueType *txQueue;
// #ifdef BOARD_HAS_PSRAM
// txQueueType *txQueue;
// #else
// RTC_DATA_ATTR txQueueType txQueue[PKGTXSIZE];
// #endif
RTC_DATA_ATTR double LastLat, LastLng;
RTC_DATA_ATTR time_t lastTimeStamp;
RTC_DATA_ATTR uint32_t COUNTER0_RAW;
RTC_DATA_ATTR uint32_t COUNTER1_RAW;

extern RTC_DATA_ATTR uint8_t digiCount;

String RF_VERSION;

Configuration config;

RTC_DATA_ATTR pkgListType *pkgList;

RTC_DATA_ATTR TelemetryType *Telemetry;

RTC_DATA_ATTR double VBat;
RTC_DATA_ATTR double TempNTC;

RTC_NOINIT_ATTR uint16_t TLM_SEQ;
RTC_NOINIT_ATTR uint16_t IGATE_TLM_SEQ;
RTC_NOINIT_ATTR uint16_t DIGI_TLM_SEQ;

TaskHandle_t taskNetworkHandle;
TaskHandle_t taskAPRSHandle;
TaskHandle_t taskAPRSPollHandle;
TaskHandle_t taskSerialHandle;
TaskHandle_t taskGPSHandle;
TaskHandle_t taskSensorHandle;

