nakhonthai/ESP32APRS_LoRa/src/main.cpp
unsigned long timerNetwork, timerNetwork_old;
unsigned long timerAPRS, timerAPRS_old;
unsigned long timerGPS, timerGPS_old;
unsigned long timerSerial, timerSerial_old;

unsigned long timeLEDoff = 500, timeLEDon = 10;

SoftwareSerial SerialRF;

bool firstGpsTime = true;
time_t startTime = 0;

#ifdef BLUETOOTH
BluetoothSerial SerialBT;

void Bluetooth()
{
    if (SerialBT.available())
    {
        char raw[500];
        int i = 0;
        memset(raw, 0, sizeof(raw));
        i = SerialBT.readBytes((uint8_t *)&raw, 500);

        if (config.bt_mode == 1)
        { // TNC2RAW MODE
            pkgTxPush(raw, strlen(raw), 1);
        }
        else if (config.bt_mode == 2)
        {
            // KISS MODE
            for (int n = 0; n < i; n++)
                kiss_serial((uint8_t)raw[n]);
        }
    }
}
#endif

// Set your Static IP address for wifi AP
IPAddress local_IP(192, 168, 4, 1);
IPAddress gateway(192, 168, 4, 254);
IPAddress subnet(255, 255, 255, 0);

IPAddress vpn_IP(192, 168, 44, 195);

int pkgTNC_count = 0;

xQueueHandle pcnt_evt_queue;              // A queue to handle pulse counter events
pcnt_isr_handle_t user_isr_handle = NULL; // user's ISR service handle

/* A sample structure to pass events from the PCNT
 * interrupt handler to the main program.
 */
typedef struct
{
    int unit;                // the PCNT unit that originated an interrupt
    uint32_t status;         // information on the event type that caused the interrupt
    unsigned long timeStamp; // The time the event occured
} pcnt_evt_t;

/* Decode what PCNT's unit originated an interrupt
 * and pass this information together with the event type
 * and timestamp to the main program using a queue.
 */
// static void IRAM_ATTR pcnt_intr_handler(void *arg)
// {
//     unsigned long currentMillis = millis(); // Time at instant ISR was called
//     uint32_t intr_status = PCNT.int_st.val;
//     int i = 0;
//     pcnt_evt_t evt;
//     portBASE_TYPE HPTaskAwoken = pdFALSE;

//     for (i = 0; i < PCNT_UNIT_MAX; i++)
//     {
//         if (intr_status & (BIT(i)))
//         {
//             evt.unit = i;
//             /* Save the PCNT event type that caused an interrupt
//                to pass it to the main program */
//             evt.status = PCNT.status_unit[i].val;
//             evt.timeStamp = currentMillis;
//             PCNT.int_clr.val = BIT(i);
//             xQueueSendFromISR(pcnt_evt_queue, &evt, &HPTaskAwoken);
//             if (HPTaskAwoken == pdTRUE)
//             {
//                 portYIELD_FROM_ISR();
//             }
//         }
//     }
// }

/* Initialize PCNT functions for one channel:
 *  - configure and initialize PCNT with pos-edge counting
 *  - set up the input filter
 *  - set up the counter events to watch
 * Variables:
 * UNIT - Pulse Counter #, INPUT_SIG - Signal Input Pin, INPUT_CTRL - Control Input Pin,
 * Channel - Unit input channel, H_LIM - High Limit, L_LIM - Low Limit,
 * THRESH1 - configurable limit 1, THRESH0 - configurable limit 2,
 */
// void pcnt_init_channel(pcnt_unit_t PCNT_UNIT, int PCNT_INPUT_SIG_IO, bool ACTIVE = false, int PCNT_INPUT_CTRL_IO = PCNT_PIN_NOT_USED, pcnt_channel_t PCNT_CHANNEL = PCNT_CHANNEL_0, int PCNT_H_LIM_VAL = 65535, int PCNT_L_LIM_VAL = 0, int PCNT_THRESH1_VAL = 50, int PCNT_THRESH0_VAL = -50)
// {
//     /* Prepare configuration for the PCNT unit */
//     pcnt_config_t pcnt_config;
//     // Set PCNT input signal and control GPIOs
//     pcnt_config.pulse_gpio_num = PCNT_INPUT_SIG_IO;
//     pcnt_config.ctrl_gpio_num = PCNT_INPUT_CTRL_IO;
//     pcnt_config.channel = PCNT_CHANNEL;
//     pcnt_config.unit = PCNT_UNIT;
//     // What to do on the positive / negative edge of pulse input?
//     if (ACTIVE)
//     {
//         pcnt_config.pos_mode = PCNT_COUNT_INC; // Count up on the positive edge
//         pcnt_config.neg_mode = PCNT_COUNT_DIS; // Keep the counter value on the negative edge
//     }
//     else
//     {
//         pcnt_config.neg_mode = PCNT_COUNT_INC; // Count up on the positive edge
//         pcnt_config.pos_mode = PCNT_COUNT_DIS; // Keep the counter value on the negative edge
//     }
//     // What to do when control input is low or high?
//     pcnt_config.lctrl_mode = PCNT_MODE_REVERSE; // Reverse counting direction if low
//     pcnt_config.hctrl_mode = PCNT_MODE_KEEP;    // Keep the primary counter mode if high
//     // Set the maximum and minimum limit values to watch
//     pcnt_config.counter_h_lim = PCNT_H_LIM_VAL;
//     pcnt_config.counter_l_lim = PCNT_L_LIM_VAL;

//     /* Initialize PCNT unit */
//     pcnt_unit_config(&pcnt_config);
//     /* Configure and enable the input filter */
//     // pcnt_set_filter_value(PCNT_UNIT, 100);
//     // pcnt_filter_enable(PCNT_UNIT);

//     /* Set threshold 0 and 1 values and enable events to watch */
//     // pcnt_set_event_value(PCNT_UNIT, PCNT_EVT_THRES_1, PCNT_THRESH1_VAL);
//     // pcnt_event_enable(PCNT_UNIT, PCNT_EVT_THRES_1);
//     // pcnt_set_event_value(PCNT_UNIT, PCNT_EVT_THRES_0, PCNT_THRESH0_VAL);
//     // pcnt_event_enable(PCNT_UNIT, PCNT_EVT_THRES_0);
//     /* Enable events on zero, maximum and minimum limit values */
//     pcnt_event_enable(PCNT_UNIT, PCNT_EVT_ZERO);
//     pcnt_event_enable(PCNT_UNIT, PCNT_EVT_H_LIM);

//     /* Initialize PCNT's counter */
//     pcnt_counter_pause(PCNT_UNIT);
//     pcnt_counter_clear(PCNT_UNIT);
//     /* Register ISR handler and enable interrupts for PCNT unit */
//     // pcnt_isr_register(pcnt_intr_handler, NULL, 0, &user_isr_handle);
//     // pcnt_intr_enable(PCNT_UNIT);

//     /* Everything is set up, now go to counting */
//     pcnt_counter_resume(PCNT_UNIT);
//     // pcnt_counter_resume(PCNT_UNIT_1);
// }

#ifdef TTGO_T_Beam_S3_SUPREME_V3
void setupPower()
{
    bool result = PMU.begin(Wire1, AXP2101_SLAVE_ADDRESS, PMU_I2C_SDA, PMU_I2C_SCL);
    if (result == false)
    {
        while (1)
        {
            log_d("PMU is not online...");
            delay(500);
        }
    }

    // Set the minimum common working voltage of the PMU VBUS input,
    // below this value will turn off the PMU
    PMU.setVbusVoltageLimit(XPOWERS_AXP2101_VBUS_VOL_LIM_3V88);

    // Set the maximum current of the PMU VBUS input,
    // higher than this value will turn off the PMU
    PMU.setVbusCurrentLimit(XPOWERS_AXP2101_VBUS_CUR_LIM_2000MA);

    // Get the VSYS shutdown voltage
    uint16_t vol = PMU.getSysPowerDownVoltage();
    log_d("->  getSysPowerDownVoltage:%u\n", vol);

    // Set VSY off voltage as 2600mV , Adjustment range 2600mV ~ 3300mV
    PMU.setSysPowerDownVoltage(2800);

