nakhonthai/ESP32APRS_LoRa/src/main.cpp
    sprintf(config.trk_symbol, "/[");
    sprintf(config.trk_symmove, "/>");
    sprintf(config.trk_symstop, "\\>");
    // sprintf(config.trk_btext, "");
    sprintf(config.trk_mycall, "NOCALL");
    sprintf(config.trk_comment, "TRACKER MODE");
    memset(config.trk_item, 0, sizeof(config.trk_item));

    // WX
    config.wx_en = false;
    config.wx_2rf = true;
    config.wx_2inet = true;
    config.wx_channel = 0;
    config.wx_ssid = 13;
    sprintf(config.wx_mycall, "NOCALL");
    config.wx_path = 8;
    sprintf(config.wx_comment, "WX MODE");
    memset(config.wx_object, 0, sizeof(config.wx_object));

    // Telemetry_0
    config.tlm0_en = false;
    config.tlm0_2rf = true;
    config.tlm0_2inet = true;
    config.tlm0_ssid = 0;
    sprintf(config.tlm0_mycall, "NOCALL");
    config.tlm0_path = 0;
    config.tlm0_data_interval = 600;
    config.tlm0_info_interval = 3600;
    sprintf(config.tlm0_PARM[0], "RF->INET");
    sprintf(config.tlm0_PARM[1], "INET->RF");
    sprintf(config.tlm0_PARM[2], "Repeater");
    sprintf(config.tlm0_PARM[3], "AllCount");
    sprintf(config.tlm0_PARM[4], "AllDrop");
    sprintf(config.tlm0_PARM[5], "IGATE");
    sprintf(config.tlm0_PARM[6], "DIGI");
    sprintf(config.tlm0_PARM[7], "WX");
    sprintf(config.tlm0_PARM[8], "SAT");
    sprintf(config.tlm0_PARM[9], "INET");
    sprintf(config.tlm0_PARM[10], "VPN");
    sprintf(config.tlm0_PARM[11], "4G");
    sprintf(config.tlm0_PARM[12], "MQTT");

    for (int i = 0; i < 5; i++)
    {
        sprintf(config.tlm0_UNIT[i], "Pkts");
        config.tlm0_EQNS[i][0] = 0; // a av2 + bv + c
        config.tlm0_EQNS[i][1] = 1; // b
        config.tlm0_EQNS[i][2] = 0; // c
    }
    sprintf(config.tlm0_UNIT[5], "En");
    sprintf(config.tlm0_UNIT[6], "En");
    sprintf(config.tlm0_UNIT[7], "En");
    sprintf(config.tlm0_UNIT[8], "En");
    sprintf(config.tlm0_UNIT[9], "ON");
    sprintf(config.tlm0_UNIT[10], "ON");
    sprintf(config.tlm0_UNIT[11], "ON");
    sprintf(config.tlm0_UNIT[12], "ON");
    config.tlm0_BITS_Active = 0xFF;
    config.tml0_data_channel[0] = 2;
    config.tml0_data_channel[1] = 3;
    config.tml0_data_channel[2] = 4;
    config.tml0_data_channel[3] = 1;
    config.tml0_data_channel[4] = 5;
    config.tml0_data_channel[5] = 1;
    config.tml0_data_channel[6] = 2;
    config.tml0_data_channel[7] = 3;
    config.tml0_data_channel[8] = 4;
    config.tml0_data_channel[9] = 5;
    config.tml0_data_channel[10] = 6;
    config.tml0_data_channel[11] = 7;
    config.tml0_data_channel[12] = 8;
    sprintf(config.tlm0_comment, "SYSTEM STATUS");

    //--Position
    config.wx_gps = false;
    config.wx_lat = 13.7555;
    config.wx_lon = 100.4930;
    config.wx_alt = 0;
    config.wx_interval = 600;
    config.wx_flage = 0;
    memset(config.wx_type, 0, sizeof(config.wx_type));

    // OLED DISPLAY
    config.oled_enable = true;
    config.oled_timeout = 60;
    config.dim = 0;
    config.contrast = 0;
    config.startup = 0;

    // Display
    config.dispDelay = 3; // Popup display 3 sec
    config.dispRF = true;
    config.dispINET = false;
    config.filterDistant = 0;
    config.dispFilter = 0xFFFF; // All filter
    config.h_up = false;
    config.tx_display = true;
    config.rx_display = true;

    // afsk,TNC
    sprintf(config.ntp_host, "ntp.dprns.com");

    sprintf(config.path[0], "WIDE1-1");
    sprintf(config.path[1], "WIDE1-1,WIDE2-1");
    sprintf(config.path[2], "TRACK3-3");
    sprintf(config.path[3], "RS0ISS");

    // VPN Wireguard
    config.vpn = false;
    config.wg_port = 51820;
    sprintf(config.wg_peer_address, "vpn.dprns.com");
    sprintf(config.wg_local_address, "192.168.1.2");
    sprintf(config.wg_netmask_address, "255.255.255.0");
    sprintf(config.wg_gw_address, "192.168.1.1");
    sprintf(config.wg_public_key, "");
    sprintf(config.wg_private_key, "");

    sprintf(config.http_username, "admin");
    sprintf(config.http_password, "admin");

    // config.gnss_baudrate = 9600;
    config.gnss_enable = false;
    // config.gnss_tx_gpio = 19;
    // config.gnss_rx_gpio = 18;
    // config.gnss_pps_gpio = -1;
    config.gnss_tcp_port = 8080;
    sprintf(config.gnss_tcp_host, "192.168.0.1");
    memset(config.gnss_at_command, 0, sizeof(config.gnss_at_command));

    config.sensor[0].enable = false;
    config.sensor[0].port = 0;
    config.sensor[0].address = 2;
    config.sensor[0].samplerate = 10;
    config.sensor[0].averagerate = 60;
    config.sensor[0].eqns[0] = 0; // a
    config.sensor[0].eqns[1] = 1; // b
    config.sensor[0].eqns[2] = 0; // c
    config.sensor[0].type = SENSOR_TEMPERATURE;
    sprintf(config.sensor[0].parm, "Temperature");
    sprintf(config.sensor[0].unit, "°C");

    config.sensor[1].enable = false;
    config.sensor[1].port = 0;
    config.sensor[1].address = 2;
    config.sensor[1].samplerate = 10;
    config.sensor[1].averagerate = 60;
    config.sensor[1].eqns[0] = 0; // a
    config.sensor[1].eqns[1] = 1; // b
    config.sensor[1].eqns[2] = 0; // c
    config.sensor[1].type = SENSOR_HUMIDITY;
    sprintf(config.sensor[1].parm, "Humidity");
    sprintf(config.sensor[1].unit, "%%RH");

    config.sensor[2].enable = false;
    config.sensor[2].port = 0;
    config.sensor[2].address = 2;
    config.sensor[2].samplerate = 10;
    config.sensor[2].averagerate = 60;
    config.sensor[2].eqns[0] = 0; // a
    config.sensor[2].eqns[1] = 1; // b
    config.sensor[2].eqns[2] = 0; // c
    config.sensor[2].type = SENSOR_PM25;
    sprintf(config.sensor[2].parm, "PM2.5");
    sprintf(config.sensor[2].unit, "μg/m³");

    config.sensor[3].enable = false;
    config.sensor[3].port = 0;
    config.sensor[3].address = 2;
    config.sensor[3].samplerate = 10;
    config.sensor[3].averagerate = 60;
    config.sensor[3].eqns[0] = 0; // a
    config.sensor[3].eqns[1] = 1; // b
    config.sensor[3].eqns[2] = 0; // c
    config.sensor[3].type = SENSOR_PM100;
    sprintf(config.sensor[3].parm, "PM10.0");
    sprintf(config.sensor[3].unit, "μg/m³");

    config.sensor[4].enable = false;
    config.sensor[4].port = 0;
    config.sensor[4].address = 2;
    config.sensor[4].samplerate = 10;
    config.sensor[4].averagerate = 60;
    config.sensor[4].eqns[0] = 0; // a
    config.sensor[4].eqns[1] = 1; // b
    config.sensor[4].eqns[2] = 0; // c
    config.sensor[4].type = SENSOR_CO2;
    sprintf(config.sensor[4].parm, "CO2");
    sprintf(config.sensor[4].unit, "ppm");

    config.sensor[5].enable = false;
    config.sensor[5].port = 0;
    config.sensor[5].address = 2;
    config.sensor[5].samplerate = 10;
    config.sensor[5].averagerate = 60;
    config.sensor[5].eqns[0] = 0; // a
    config.sensor[5].eqns[1] = 1; // b
    config.sensor[5].eqns[2] = 0; // c
    config.sensor[5].type = SENSOR_CH2O;
    sprintf(config.sensor[5].parm, "CH2O");
    sprintf(config.sensor[5].unit, "μg/m³");

    config.sensor[6].enable = false;
    config.sensor[6].port = 0;
    config.sensor[6].address = 2;
    config.sensor[6].samplerate = 10;
    config.sensor[6].averagerate = 60;
    config.sensor[6].eqns[0] = 0; // a
    config.sensor[6].eqns[1] = 1; // b
    config.sensor[6].eqns[2] = 0; // c
    config.sensor[6].type = SENSOR_TVOC;
    sprintf(config.sensor[6].parm, "TVOC");
    sprintf(config.sensor[6].unit, "μg/m³");

