nakhonthai/ESP32APRS_LoRa/src/main.cpp
    config.sensor[7].enable = false;
    config.sensor[7].port = 0;
    config.sensor[7].address = 2;
    config.sensor[7].samplerate = 10;
    config.sensor[7].averagerate = 60;
    config.sensor[7].eqns[0] = 0; // a
    config.sensor[7].eqns[1] = 1; // b
    config.sensor[7].eqns[2] = 0; // c
    config.sensor[7].type = SENSOR_PRESSURE;
    sprintf(config.sensor[7].parm, "Pressure");
    sprintf(config.sensor[7].unit, "hPa(mBar)");

    config.sensor[8].enable = false;
    config.sensor[8].port = 0;
    config.sensor[8].address = 2;
    config.sensor[8].samplerate = 10;
    config.sensor[8].averagerate = 60;
    config.sensor[8].eqns[0] = 0;   // a
    config.sensor[8].eqns[1] = 0.2; // b
    config.sensor[8].eqns[2] = 0;   // c
    config.sensor[8].type = SENSOR_RAIN;
    sprintf(config.sensor[8].parm, "Rain");
    sprintf(config.sensor[8].unit, "mm.");

    config.sensor[9].enable = false;
    config.sensor[9].port = 0;
    config.sensor[9].address = 2;
    config.sensor[9].samplerate = 10;
    config.sensor[9].averagerate = 60;
    config.sensor[9].eqns[0] = 0; // a
    config.sensor[9].eqns[1] = 1; // b
    config.sensor[9].eqns[2] = 0; // c
    config.sensor[9].type = SENSOR_WIND_SPD;
    sprintf(config.sensor[9].parm, "Wind Speed");
    sprintf(config.sensor[9].unit, "kPh");

#ifdef CORE_DEBUG_LEVEL
    config.uart0_enable = true;
    config.uart0_baudrate = 115200;
    config.uart0_rx_gpio = 20;
    config.uart0_tx_gpio = 21;
    config.uart0_rts_gpio = -1;
#else
    config.uart0_enable = false;
    config.uart0_baudrate = 9600;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.uart0_rts_gpio = -1;
#endif

    config.uart1_enable = false;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 18;
    config.uart1_tx_gpio = 19;
    config.uart1_rts_gpio = -1;

    // config.uart2_enable = false;
    // config.uart2_baudrate = 9600;
    // config.uart2_rx_gpio = 16;
    // config.uart2_tx_gpio = 17;
    // config.uart2_rts_gpio = -1;

    config.modbus_enable = false;
    config.modbus_de_gpio = -1;
    config.modbus_address = 0;
    config.modbus_channel = 0;

    config.onewire_enable = false;
    config.onewire_gpio = -1;

    config.pwr_en = false;
    config.pwr_mode = MODE_A;        // A=Continue,B=Wait for receive,C=Send and sleep
    config.pwr_sleep_interval = 600; // sec
    config.pwr_stanby_delay = 300;   // sec
    config.pwr_sleep_activate = ACTIVATE_TRACKER | ACTIVATE_WIFI;
    config.pwr_gpio = -1;

    for (int i = 0; i < 5; i++)
    {
        config.trk_tlm_avg[i] = false;
        config.trk_tlm_sensor[i] = 0;
        config.trk_tlm_precision[i] = 0;
        config.trk_tlm_offset[i] = 0;
        memset(config.trk_tlm_UNIT[i], 0, 8);
        memset(config.trk_tlm_PARM[i], 0, 10);
        config.trk_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.trk_tlm_EQNS[i][1] = 1; // b
        config.trk_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < 5; i++)
    {
        config.digi_tlm_avg[i] = false;
        config.digi_tlm_sensor[i] = 0;
        config.digi_tlm_precision[i] = 0;
        config.digi_tlm_offset[i] = 0;
        memset(config.digi_tlm_UNIT[i], 0, 8);
        memset(config.digi_tlm_PARM[i], 0, 10);
        config.digi_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.digi_tlm_EQNS[i][1] = 1; // b
        config.digi_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < 5; i++)
    {
        config.igate_tlm_avg[i] = false;
        config.igate_tlm_sensor[i] = 0;
        config.igate_tlm_precision[i] = 0;
        config.igate_tlm_offset[i] = 0;
        memset(config.igate_tlm_UNIT[i], 0, 8);
        memset(config.igate_tlm_PARM[i], 0, 10);
        config.igate_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.igate_tlm_EQNS[i][1] = 1; // b
        config.igate_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < WX_SENSOR_NUM; i++)
    {
        config.wx_sensor_enable[i] = false;
        config.wx_sensor_avg[i] = true;
        config.wx_sensor_ch[i] = 0;
    }

#ifdef OLED
    config.i2c_enable = true;
    config.i2c_sda_pin = 0;
    config.i2c_sck_pin = 1;
#else
    config.i2c_enable = false;
    config.i2c_sda_pin = -1;
    config.i2c_sck_pin = -1;
#endif

#ifdef TTGO_LORA32_V1
    config.rf_type = RF_SX1276;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 26;
    config.rf_reset_gpio = 14;
    config.rf_busy_gpio = -1;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 4;
    config.i2c_sck_pin = 15;
#elif defined(HT_CT62)
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 3;
    config.rf_reset_gpio = 5;
    config.rf_busy_gpio = 4;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 10;
    config.rf_miso_gpio = 6;
    config.rf_mosi_gpio = 7;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;    
#elif defined(ESP32_DIY_LoRa_GPS) || defined(TTGO_T_LORA32_V2_1_GPS)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = -1;
    config.rf_reset_gpio = 23;
    config.rf_busy_gpio = -1;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_tx_gpio = 12;
    config.gnss_rx_gpio = 34;
#elif defined(TTGO_T_Beam_V1_2)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 33; // SX1278 DIO0=26
    config.rf_reset_gpio = 23;
    config.rf_busy_gpio = -1;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 34;
    config.uart1_tx_gpio = 12;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 13;
    config.i2c_sck_pin = 14;
    config.i2c1_enable = true;
    config.i2c1_sda_pin = PMU_I2C_SDA;
    config.i2c1_sck_pin = PMU_I2C_SCL;
#elif defined(TTGO_T_Beam_S3_SUPREME_V3)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 1;
    config.rf_reset_gpio = 5;
    config.rf_busy_gpio = 4;
    config.rf_nss_gpio = 10;
    config.rf_sclk_gpio = 12;
    config.rf_miso_gpio = 13;
    config.rf_mosi_gpio = 11;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 9;
    config.uart1_tx_gpio = 8;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 17;
    config.i2c_sck_pin = 18;
    config.i2c1_enable = true;
    config.i2c1_sda_pin = PMU_I2C_SDA;
    config.i2c1_sck_pin = PMU_I2C_SCL;
#elif defined(HELTEC_V3_GPS)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 14;
    config.rf_reset_gpio = 12;
    config.rf_busy_gpio = 13;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 9;
    config.rf_miso_gpio = 11;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_tx_gpio = 20;
    config.gnss_rx_gpio = 19;
    config.i2c_enable = true;
    config.i2c_sda_pin = 17;
    config.i2c_sck_pin = 18;
    config.i2c_rst_pin = 21;
#elif defined(TTGO_T_Beam_V1_0_SX1268) || defined(TTGO_T_Beam_V1_2_SX1262)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 33;
    config.rf_reset_gpio = 23;
    config.rf_busy_gpio = 32;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_tx_gpio = 12;
    config.gnss_rx_gpio = 15;
    // config.i2c_enable = true;
    // config.i2c_sda_pin = 17;
    // config.i2c_sck_pin = 18;
    // config.i2c_rst_pin = 21;
#elif defined(APRS_LORA_HT)
    config.rf_en = true;
    config.rf_type = RF_SX1268;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 45;
    config.rf_reset_gpio = 11;
    config.rf_busy_gpio = 14;
    config.rf_nss_gpio = 17;
    config.rf_sclk_gpio = 18;
    config.rf_miso_gpio = 8;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 44;
    config.uart1_tx_gpio = 43;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 21;
    config.i2c_sck_pin = 47;
    config.pwr_gpio = 41;
    sprintf(config.wifi_ap_ssid, "LoRa_HT");
    sprintf(config.wifi_ap_pass, "aprsthnetwork");
#elif defined(HELTEC_HTIT_TRACKER)
    config.rf_en = true;
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 14;
    config.rf_reset_gpio = 12;
    config.rf_busy_gpio = 13;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 9;
    config.rf_miso_gpio = 11;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 115200;
    config.uart1_rx_gpio = 33;
    config.uart1_tx_gpio = 34;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = false;
    config.i2c_sda_pin = -1;
    config.i2c_sck_pin = -1;
    config.pwr_gpio = 3;
#endif

    config.i2c_freq = 400000;
    config.i2c1_enable = false;
    config.i2c1_sda_pin = -1;
    config.i2c1_sck_pin = -1;
    config.i2c1_freq = 100000;

    config.counter0_enable = false;
    config.counter0_active = 0;
    config.counter0_gpio = -1;

    config.counter1_enable = false;
    config.counter1_active = 0;
    config.counter1_gpio = -1;

    config.ext_tnc_enable = false;
    config.ext_tnc_channel = 0;
    config.ext_tnc_mode = 2;

    sprintf(config.path[0], "TRACE2-2");
    sprintf(config.path[1], "WIDE1-1");
    sprintf(config.path[2], "WIDE1-1,WIDE2-1");
    sprintf(config.path[3], "RFONLY");

