nakhonthai/ESP32APRS_LoRa/src/main.cpp
    config.log = 0;

#ifdef BUOY
    sprintf(config.wifi_ap_ssid, "miniBUOY_0");
    config.wifi_mode |= WIFI_AP_FIX;
    config.log |= 1;
    config.pwr_gpio = 2;
    sprintf(config.trk_symbol, "\\N");
    config.trk_gps = true;
    config.trk_loc2rf = true;
    config.trk_loc2inet = true;
    config.trk_smartbeacon = false;
    config.trk_compress = true;
    config.trk_en = true;
    config.trk_sat = false;
    config.trk_dx = false;
    config.trk_path = 2;
    config.trk_ssid = 11;
    config.trk_timestamp = false;
    config.igate_en = true;
    config.aprs_port = 24580;
    sprintf(config.aprs_mycall, "CBBT0");
    sprintf(config.trk_mycall, "CBBT0");
    memset(config.trk_item,0,10);
    //sprintf(config.trk_item, "BTL0");
    config.trk_comment[0] = 0;
    config.rf_power = 22;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 19;
    config.uart1_tx_gpio = 18;
    config.uart1_rts_gpio = -1;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.rf_en = true;

    config.wifi_sta[1].enable = true;
    sprintf(config.wifi_sta[1].wifi_ssid, "BUOY");
    sprintf(config.wifi_sta[1].wifi_pass, "aprsthnetwork");

    config.sensor[0].enable = true;
    config.sensor[0].port = 2;
    config.sensor[0].address = 1;
    config.sensor[0].samplerate = 10;
    config.sensor[0].averagerate = 60;
    config.sensor[0].eqns[0] = 0; // a
    config.sensor[0].eqns[1] = 1; // b
    config.sensor[0].eqns[2] = 0; // c
    config.sensor[0].type = SENSOR_TEMPERATURE;
    sprintf(config.sensor[0].parm, "Temperature");
    sprintf(config.sensor[0].unit, "°C");

    config.sensor[1].enable = true;
    config.sensor[1].port = 22;
    config.sensor[1].address = 0;
    config.sensor[1].samplerate = 10;
    config.sensor[1].averagerate = 60;
    config.sensor[1].eqns[0] = 0; // a
    config.sensor[1].eqns[1] = 1; // b
    config.sensor[1].eqns[2] = 0; // c
    config.sensor[1].type = SENSOR_BAT_VOLTAGE;
    sprintf(config.sensor[1].parm, "BAT");
    sprintf(config.sensor[1].unit, "V");

    config.trk_tlm_avg[0] = false;
    config.trk_tlm_sensor[0] = 1;
    config.trk_tlm_precision[0] = 2;
    config.trk_tlm_offset[0] = 0;
    sprintf(config.trk_tlm_UNIT[0], "°C");
    sprintf(config.trk_tlm_PARM[0], "TEMP");
    config.trk_tlm_EQNS[0][0] = 0;    // a av2 + bv + c
    config.trk_tlm_EQNS[0][1] = 0.01; // b
    config.trk_tlm_EQNS[0][2] = 0;    // c

    config.trk_tlm_avg[1] = false;
    config.trk_tlm_sensor[1] = 2;
    config.trk_tlm_precision[1] = 2;
    config.trk_tlm_offset[1] = 0;
    sprintf(config.trk_tlm_UNIT[1], "V");
    sprintf(config.trk_tlm_PARM[1], "BAT");
    config.trk_tlm_EQNS[1][0] = 0;    // a av2 + bv + c
    config.trk_tlm_EQNS[1][1] = 0.01; // b
    config.trk_tlm_EQNS[1][2] = 0;    // c
#endif
    // if(strlen(config.trk_item)>3)
    //     sprintf(config.wifi_ap_ssid,"%s",config.trk_item);
    // else
    //     sprintf(config.wifi_ap_ssid,"%s-%d",config.trk_mycall,config.trk_ssid);

    saveEEPROM();
}

unsigned long NTP_Timeout;
unsigned long pingTimeout;

bool psramBusy = false;

const char *lastTitle = "LAST HEARD";

int tlmList_Find(char *call)
{
    int i;
    for (i = 0; i < TLMLISTSIZE; i++)
    {
        if (strstr(Telemetry[i].callsign, call) != NULL)
            return i;
    }
    return -1;
}

int tlmListOld()
{
    int i, ret = 0;
    time_t minimum = Telemetry[0].time;
    for (i = 1; i < TLMLISTSIZE; i++)
    {
        if (Telemetry[i].time < minimum)
        {
            minimum = Telemetry[i].time;
            ret = i;
        }
        if (Telemetry[i].time > now())
            Telemetry[i].time = 0;
    }
    return ret;
}

int pkgList_Find(char *call)
{
    int i;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (strstr(pkgList[(int)i].calsign, call) != NULL)
            return i;
    }
    return -1;
}

int pkgList_Find(char *call, uint16_t type)
{
    int i;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if ((strstr(pkgList[i].calsign, call) != NULL) && (pkgList[i].type == type))
            return i;
    }
    return -1;
}

int pkgListOld()
{
    int i, ret = -1;
    time_t minimum = time(NULL) + 86400; // pkgList[0].time;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (pkgList[(int)i].time < minimum)
        {
            minimum = pkgList[(int)i].time;
            ret = i;
        }
    }
    return ret;
}

void sort(pkgListType a[], int size)
{
    pkgListType t;
    char *ptr1;
    char *ptr2;
    char *ptr3;
    ptr1 = (char *)&t;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    for (int i = 0; i < (size - 1); i++)
    {
        for (int o = 0; o < (size - (i + 1)); o++)
        {
            if (a[o].time < a[o + 1].time)
            {
                ptr2 = (char *)&a[o];
                ptr3 = (char *)&a[o + 1];
                memcpy(ptr1, ptr2, sizeof(pkgListType));
                memcpy(ptr2, ptr3, sizeof(pkgListType));
                memcpy(ptr3, ptr1, sizeof(pkgListType));
            }
        }
    }
    psramBusy = false;
}

void sortPkgDesc(pkgListType a[], int size)
{
    pkgListType t;
    char *ptr1;
    char *ptr2;
    char *ptr3;
    ptr1 = (char *)&t;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    for (int i = 0; i < (size - 1); i++)
    {
        for (int o = 0; o < (size - (i + 1)); o++)
        {
            if (a[o].pkg < a[o + 1].pkg)
            {
                ptr2 = (char *)&a[o];
                ptr3 = (char *)&a[o + 1];
                memcpy(ptr1, ptr2, sizeof(pkgListType));
                memcpy(ptr2, ptr3, sizeof(pkgListType));
                memcpy(ptr3, ptr1, sizeof(pkgListType));
            }
        }
    }
    psramBusy = false;
}

uint16_t pkgType(const char *raw)
{
    uint16_t type = 0;
    char packettype = 0;
    const char *info_start, *body;
    int paclen = strlen(raw);
    char *ptr;

    if (*raw == 0)
        return 0;

    packettype = (char)raw[0];
    body = &raw[1];

