nakhonthai/ESP32APRS_LoRa/src/main.cpp
void preTransmission()
{
    digitalWrite(config.modbus_de_gpio, 1);
}

void postTransmission()
{
    digitalWrite(config.modbus_de_gpio, 0);
}

// 3 seconds WDT
#define WDT_TIMEOUT 30

bool AFSKInitAct = false;
unsigned long timeTask;
void setup()
{
    byte *ptr;
    int BootReason = esp_reset_reason();
#ifdef BOARD_HAS_PSRAM
    pkgList = (pkgListType *)ps_malloc(sizeof(pkgListType) * PKGLISTSIZE);
    Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
    txQueue = (txQueueType *)ps_malloc(sizeof(txQueueType) * PKGTXSIZE);
    // TNC2Raw = (int *)ps_malloc(sizeof(int) * PKGTXSIZE);
#else
    pkgList = (pkgListType *)malloc(sizeof(pkgListType) * PKGLISTSIZE);
    Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
    txQueue = (txQueueType *)malloc(sizeof(txQueueType) * PKGTXSIZE);
    // TNC2Raw = (int *)malloc(sizeof(int) * PKGTXSIZE);
#endif

    memset(pkgList, 0, sizeof(pkgListType) * PKGLISTSIZE);
    memset(Telemetry, 0, sizeof(TelemetryType) * TLMLISTSIZE);
    memset(txQueue, 0, sizeof(txQueueType) * PKGTXSIZE);

    // pinMode(9, INPUT_PULLUP); // BOOT Button
    pinMode(LED_RX, OUTPUT);
    pinMode(LED_TX, OUTPUT);

    // pinMode(0, INPUT);
    // pinMode(1, INPUT);
    //  Set the CPU frequency to 80 MHz for power optimization
    //setCpuFrequencyMhz(80);

#ifdef APRS_LORA_HT
    pinMode(0, INPUT);
    pinMode(1, INPUT);
    pinMode(2, INPUT);
    pinMode(38, INPUT);
    pinMode(40, INPUT);
    pinMode(48, INPUT);
    pinMode(45, INPUT);
    pinMode(3, ANALOG);
    pinMode(12, INPUT);
    pinMode(13, OUTPUT);
    pinMode(39, OUTPUT);
    digitalWrite(39, LOW);
    analogReadResolution(12);
    analogSetAttenuation(ADC_11db);
#endif

#ifdef HELTEC_HTIT_TRACKER
    pinMode(2, OUTPUT); // ADC_Ctl
    digitalWrite(2, HIGH);
#endif

    // Set up serial port
#ifdef CORE_DEBUG_LEVEL
    Serial.begin(115200); // debug
#else
    Serial.begin(9600); // monitor
#endif

    if (!LITTLEFS.begin(FORMAT_LITTLEFS_IF_FAILED))
    {
        log_d("LITTLEFS Mount Failed");
        // return;
    }
    else
    {
        log_d("File system mounted");
        log_d("Total space: %lu\n", LITTLEFS.totalBytes());
        log_d("Use space:  %lu\n\n", LITTLEFS.usedBytes());
    }

    log_d("Start ESP32APRS_LoRa V%s", VERSION);
    // log_d("Push BOOT after 3 sec for Factory Default config.");

    if (!EEPROM.begin(EEPROM_SIZE))
    {
        log_d("failed to initialise EEPROM"); // delay(100000);
    }
    // ตรวจสอบคอนฟิกซ์ผิดพลาด
    ptr = (byte *)&config;
    EEPROM.readBytes(1, ptr, sizeof(Configuration));
    uint8_t chkSum = checkSum(ptr, sizeof(Configuration));
    log_d("EEPROM Check %0Xh=%0Xh(%dByte)\n", EEPROM.read(0), chkSum, sizeof(Configuration));
    if (EEPROM.read(0) != chkSum || EEPROM.read(0) == 0)
    {
        log_d("CRC EEPROM Error!");
        log_d("Factory Default");
        defaultConfig();
    }

#ifdef BUOY
    config.wifi_mode |= WIFI_AP_FIX;
    pinMode(BOOT_PIN, OUTPUT_OPEN_DRAIN);
    digitalWrite(BOOT_PIN, LOW);
    timeLEDoff = 500;
    timeLEDon = 10;
#else
    pinMode(BOOT_PIN, INPUT_PULLUP);
#endif

    Sleep_Activate = config.pwr_sleep_activate;
    pinMode(config.pwr_gpio, OUTPUT);
    digitalWrite(config.pwr_gpio, HIGH);

    if (config.i2c1_enable)
    {
        Wire1.begin(config.i2c1_sda_pin, config.i2c1_sck_pin, config.i2c1_freq);
    }

#if defined(TTGO_T_Beam_S3_SUPREME_V3) || defined(TTGO_T_Beam_V1_2)
    setupPower();
#endif

#ifdef OLED
    config.i2c_enable = true;
    // pinMode(OLED_RESET,OUTPUT);
    // digitalWrite(OLED_RESET,HIGH);
    // delay(300);
    Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);

    // #ifdef APRS_LORA_HT
    // IP5306 ip5306(config.i2c_sda_pin,config.i2c_sck_pin);  //create instance

    // //set battery voltage
    // ip5306.set_battery_voltage(BATT_VOLTAGE_0);   //4.2V

    // //Voltage Vout for charging
    // ip5306.charger_under_voltage(VOUT_5);         //4.7V

    // //set charging complete current
    // ip5306.end_charge_current(CURRENT_400);       //400mA

    // //set cutoff voltage
    // ip5306.set_charging_stop_voltage(CUT_OFF_VOLTAGE_3);    // 4.2/4.305/4.35/4.395  V

    // //set light load shutdown time
    // ip5306.set_light_load_shutdown_time(SHUTDOWN_64s);      //64s

    // //enable low battery shutdown mode
    // ip5306.low_battery_shutdown(ENABLE);

    // //allow boost even after removing Vin
    // ip5306.boost_after_vin(ENABLE);

    // //allow auto power on after load detection
    // ip5306.power_on_load(ENABLE);

    // //enable boost mode
    // ip5306.boost_mode(ENABLE);
    // #endif
    int i2c_timeout = 0;
    while (i2c_busy)
    {
        delay(10);
        if (++i2c_timeout > 20)
            break;
    }
    i2c_busy = true;
    // by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
    if (OLED_RESET > -1)
    {
        display.begin(SSD1306_SWITCHCAPVCC, 0x3C, true, false); // initialize with the I2C addr 0x3C (for the 128x64)
    }
    else
    {
        display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false, false); // initialize with the I2C addr 0x3C (for the 128x64)
    }
    // Initialising the UI will init the display too.
    if(BootReason != ESP_RST_DEEPSLEEP){ 
        display.clearDisplay();
        display.setTextSize(1);
        display.setTextColor(WHITE);

        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);
          
        display.setCursor(0, 15);
        display.print("APRS");
        display.setCursor(65, 32);
        display.print("LoRa");
        display.drawYBitmap(0, 16, LOGO, 48, 48, WHITE);
        display.drawRoundRect(52, 16, 75, 22, 3, WHITE);

        display.setFont();
        display.setTextColor(WHITE);

        display.setCursor(60, 40);
        display.printf("FW Ver %s%c", VERSION, VERSION_BUILD);
        display.setCursor(65, 5);
        display.print("Copy@2024");
        display.display();

        delay(1000);
        digitalWrite(LED_TX, HIGH);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("3 Sec");
        display.display();
        delay(1000);
        digitalWrite(LED_RX, HIGH);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("2 Sec");
        display.display();
        delay(1000);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("1 Sec");
        display.display();
        delay(1000);

        if (digitalRead(BOOT_PIN) == LOW)
        {
            defaultConfig();
            log_d("Manual Default configure!");
#ifdef OLED
            display.clearDisplay();
            display.setCursor(10, 22);
            display.print("Factory Reset!");
            display.display();
#endif
            while (digitalRead(BOOT_PIN) == LOW)
            {
                delay(500);
                digitalWrite(LED_TX, LOW);
                digitalWrite(LED_RX, LOW);
                delay(500);
                digitalWrite(LED_TX, HIGH);
                digitalWrite(LED_RX, HIGH);
            }
        }
    }else{
        showDisp = true;
    }
    display.setFont();
    display.setTextColor(WHITE);
    i2c_busy = false;
#else
#ifdef ST7735_160x80
    TFT_SPI.begin(ST7735_SCLK_Pin, -1, ST7735_MOSI_Pin, ST7735_CS_Pin);
    TFT_SPI.setFrequency(40000000);
    pinMode(ST7735_LED_K_Pin, OUTPUT);
    digitalWrite(ST7735_LED_K_Pin, HIGH);
    display.initR(ST7735_MODEL); // initialize a ST7735S chip, mini display
    display.setRotation(3);
    display.invertDisplay(false);
    if(BootReason != ESP_RST_DEEPSLEEP){
        display.fillScreen(ST77XX_BLACK);
        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);    
    
