nakhonthai/ESP32APRS_LoRa/src/main.cpp
        display.setTextColor(ST77XX_YELLOW);
        display.setCursor(10, 15);
        display.print("APRS");
        display.fillRoundRect(72, 16, 75, 22, 3, ST77XX_WHITE);
        display.setTextColor(ST77XX_RED);
        display.setCursor(85, 32);
        display.print("LoRa");
        display.drawYBitmap(10, 26, LOGO, 48, 48, ST77XX_BLUE);
        // display.drawRoundRect(72, 16, 75, 22, 3, ST77XX_WHITE);

        display.setFont();
        display.setTextColor(ST77XX_GREEN);

        display.setCursor(80, 50);
        display.printf("FW Ver %s%c", VERSION, VERSION_BUILD);
        display.setCursor(85, 5);
        display.print("Copy@2024");

        delay(1000);
        digitalWrite(LED_TX, HIGH);
        display.fillRect(69, 59, 50, 8, 0);
        display.setCursor(90, 60);
        display.print("3 Sec");

        delay(1000);
        digitalWrite(LED_RX, HIGH);
        display.fillRect(69, 59, 50, 8, 0);
        display.setCursor(90, 60);
        display.print("2 Sec");

        delay(1000);
        display.fillRect(69, 59, 50, 8, 0);
        display.setCursor(90, 60);
        display.print("1 Sec");

        delay(1000);
    

        if (digitalRead(BOOT_PIN) == LOW)
        {
            defaultConfig();
            log_d("Manual Default configure!");
    #ifdef ST7735_160x80
            display.fillRect(69, 59, 50, 8, 0);
            display.setCursor(70, 60);
            display.print("Factory Reset!");
    #endif
            while (digitalRead(BOOT_PIN) == LOW)
            {
                delay(500);
                digitalWrite(LED_TX, LOW);
                digitalWrite(LED_RX, LOW);
                delay(500);
                digitalWrite(LED_TX, HIGH);
                digitalWrite(LED_RX, HIGH);
            }
        }
    }else{
        showDisp = true;
    }
    digitalWrite(LED_TX, LOW);
    digitalWrite(LED_RX, LOW);
#endif
    if (config.i2c_enable)
    {
        Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);
    }
    if (config.pwr_mode != MODE_A)
    {
        delay(1000);
        digitalWrite(LED_TX, LOW);
        delay(1000);
        digitalWrite(LED_RX, LOW);
        delay(1000);
    }
#endif
    if (config.pwr_mode != MODE_A)
    {
        //         if (digitalRead(9) == LOW)
        //         {
        //             defaultConfig();
        //             log_d("Manual Default configure!");
        // #ifdef OLED
        //             display.clearDisplay();
        //             display.setCursor(10, 22);
        //             display.print("Factory Reset!");
        //             display.display();
        // #endif
        //             while (digitalRead(9) == LOW)
        //             {
        //                 delay(500);
        //                 digitalWrite(LED_TX, LOW);
        //                 digitalWrite(LED_RX, LOW);
        //                 delay(500);
        //                 digitalWrite(LED_TX, HIGH);
        //                 digitalWrite(LED_RX, HIGH);
        //             }
        //         }
        digitalWrite(LED_TX, LOW);
        digitalWrite(LED_RX, LOW);
    }

    if (config.uart0_enable)
    {
#ifndef CORE_DEBUG_LEVEL
#if ARDUINO_USB_CDC_ON_BOOT
        Serial0.begin(config.uart0_baudrate, SERIAL_8N1, config.uart0_rx_gpio, config.uart0_tx_gpio);
#else
        Serial.begin(config.uart0_baudrate, SERIAL_8N1, config.uart0_rx_gpio, config.uart0_tx_gpio);
#endif
#endif
    }
    if (config.uart1_enable)
    {
        Serial1.begin(config.uart1_baudrate, SERIAL_8N1, config.uart1_rx_gpio, config.uart1_tx_gpio);
    }

    if (config.modbus_enable)
    {
        if (config.modbus_channel == 1)
        {
            modbus.begin(config.modbus_address, Serial);
        }
        else if (config.modbus_channel == 2)
        {
            modbus.begin(config.modbus_address, Serial1);
        }
        else if (config.modbus_channel == 3)
        {
            // modbus.begin(config.modbus_address, Serial2);
        }
        if (config.modbus_channel > 0 && config.modbus_channel < 4)
        {
            // Modbus slave ID 1
            if (config.modbus_de_gpio > -1)
            {
                pinMode(config.modbus_de_gpio, OUTPUT);
                // Callbacks allow us to configure the RS485 transceiver correctly
                modbus.preTransmission(preTransmission);
                modbus.postTransmission(postTransmission);
            }
        }
    }

    log_d("Free heap: %d", ESP.getHeapSize());
#ifdef BLUETOOTH
    if (config.bt_master)
        SerialBT.begin(config.bt_name); // Bluetooth device name
#endif

#ifdef OLED
    if (config.oled_enable == true)
    {
        int i2c_timeout = 0;
        while (i2c_busy)
        {
            delay(10);
            if (++i2c_timeout > 20)
                break;
        }
        i2c_busy = true;
        display.clearDisplay();
        display.setTextSize(1);
        display.display();
        i2c_busy = false;
    }
#elif defined(ST7735_160x80)
    display.fillScreen(ST77XX_BLACK);
    display.setTextSize(1);
#endif

    showDisp = true;
    oledSleepTimeout = millis() + (config.oled_timeout * 1000);

    // enableLoopWDT();
    // enableCore0WDT();
    // enableCore1WDT();
    esp_task_wdt_init(WDT_TIMEOUT, true); // enable panic so ESP32 restarts
    esp_task_wdt_add(NULL);               // add current thread to WDT watch

    oledSleepTimeout = millis() + (config.oled_timeout * 1000);
    AFSKInitAct = false;

    if (config.gnss_enable)
    {
        if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
        {
            if (strstr("AT", config.gnss_at_command) >= 0)
            {
                if (config.gnss_channel == 1)
                {
#if ARDUINO_USB_CDC_ON_BOOT
                    Serial0.println(config.gnss_at_command);
#else
                    Serial.println(config.gnss_at_command);
#endif
                }
                else if (config.gnss_channel == 2)
                {
                    Serial1.println(config.gnss_at_command);
                }
            }
        }
    }
    
    StandByTick = millis() + (config.pwr_stanby_delay*1000);

    // Task 1
    xTaskCreatePinnedToCore(
        taskAPRS,        /* Function to implement the task */
        "taskAPRS",      /* Name of the task */
        8192,            /* Stack size in words */
        NULL,            /* Task input parameter */
        2,               /* Priority of the task */
        &taskAPRSHandle, /* Task handle. */
        0);              /* Core where the task should run */

// Task 2
#ifdef __XTENSA__
    xTaskCreatePinnedToCore(
        taskNetwork,        /* Function to implement the task */
        "taskNetwork",      /* Name of the task */
        12000,              /* Stack size in words */
        NULL,               /* Task input parameter */
        0,                  /* Priority of the task */
        &taskNetworkHandle, /* Task handle. */
        1);                 /* Core where the task should run */
#else
    xTaskCreatePinnedToCore(
        taskNetwork,        /* Function to implement the task */
        "taskNetwork",      /* Name of the task */
        16384,              /* Stack size in words */
        NULL,               /* Task input parameter */
        1,                  /* Priority of the task */
        &taskNetworkHandle, /* Task handle. */
        0);                 /* Core where the task should run */
#endif

    xTaskCreatePinnedToCore(
        taskAPRSPoll,        /* Function to implement the task */
        "taskAPRSPoll",      /* Name of the task */
        4096,                /* Stack size in words */
        NULL,                /* Task input parameter */
        3,                   /* Priority of the task */
        &taskAPRSPollHandle, /* Task handle. */
        0);                  /* Core where the task should run */

    if (config.gnss_enable)
    {
        xTaskCreatePinnedToCore(
            taskGPS,        /* Function to implement the task */
            "taskGPS",      /* Name of the task */
            3072,           /* Stack size in words */
            NULL,           /* Task input parameter */
            4,              /* Priority of the task */
            &taskGPSHandle, /* Task handle. */
            0);             /* Core where the task should run */
    }

    if (config.ext_tnc_enable || (config.wx_en && (config.wx_channel > 0 && config.wx_channel < 4)))
    {
        xTaskCreatePinnedToCore(
            taskSerial,        /* Function to implement the task */
            "taskSerial",      /* Name of the task */
            2048,              /* Stack size in words */
            NULL,              /* Task input parameter */
            5,                 /* Priority of the task */
            &taskSerialHandle, /* Task handle. */
            0);                /* Core where the task should run */
    }

    xTaskCreatePinnedToCore(
        taskSensor,        /* Function to implement the task */
        "taskSensor",      /* Name of the task */
        3000,              /* Stack size in words */
        NULL,              /* Task input parameter */
        6,                 /* Priority of the task */
        &taskSensorHandle, /* Task handle. */
        0);                /* Core where the task should run */
    
    timeTask = millis() + 10000;
}

String getTimeStamp()
{
    char strtmp[50];
    time_t now;
    time(&now);
    struct tm *info = gmtime(&now);
    sprintf(strtmp, "%02d%02d%02dz", info->tm_mday, info->tm_hour, info->tm_min);
    return String(strtmp);
}

int pkgCount = 0;

float conv_coords(float in_coords)
{
    // Initialize the location.
    float f = in_coords;
    // Get the first two digits by turning f into an integer, then doing an integer divide by 100;
    // firsttowdigits should be 77 at this point.
    int firsttwodigits = ((int)f) / 100; // This assumes that f < 10000.
    float nexttwodigits = f - (float)(firsttwodigits * 100);
    float theFinalAnswer = (float)(firsttwodigits + nexttwodigits / 60.0);
    return theFinalAnswer;
}

void DD_DDDDDtoDDMMSS(float DD_DDDDD, int *DD, int *MM, int *SS)
{
    DD_DDDDD = abs(DD_DDDDD);
    *DD = (int)DD_DDDDD;
    *MM = (int)((DD_DDDDD - *DD) * 60);
    *SS = ((DD_DDDDD - *DD) * 60 - *MM) * 100;
}

String compress_position(double nowLat, double nowLng, int alt_feed, double course, uint16_t spdKnot, char table, char symbol, bool gps)
{
    String str_comp = "";
    String lat, lon;
    lat = deg2lat(nowLat);
    lon = deg2lon(nowLng);
    // ESP_LOGE("GPS", "Aprs Compress");
    //  Translate from semicircles to Base91 format
    char aprs_position[13];
    long latitude = semicircles((char *)lat.c_str(), (nowLat < 0));
    long longitude = semicircles((char *)lon.c_str(), (nowLng < 0));
    long ltemp = 1073741824L - latitude; // 90 degrees - latitude
    // ESP_LOGE("GPS", "lat=%u lon=%u", latitude, longitude);
    memset(aprs_position, 0, sizeof(aprs_position));

