nakhonthai/ESP32APRS_LoRa/src/main.cpp
    // Give space between parts of the same letter...equal to one dot
    // delay(dot_duration);
    vTaskDelay(dot_duration / portTICK_PERIOD_MS);
}

/**
 *  Flashes the Morse code for the input letter or number
 *  @param morse_code pointer to the morse code
 */
void flash_morse_code(const char *morse_code)
{

    unsigned int i = 0;

    // Read the dots and dashes and flash accordingly
    while (morse_code[i] != '\0')
    {
        flash_dot_or_dash(morse_code[i]);
        i++;
        if (i > 7)
            break;
    }

    // Space between two letters is equal to three dots
    // delay(dot_duration * 3);
    vTaskDelay(dot_duration * 3 / portTICK_PERIOD_MS);
}

void flash_morse_text(char *text, size_t len)
{
    char ch;
    for (int i = 0; i < len; i++)
    {
        ch = text[i];
        // Check for uppercase letters
        if (ch >= 'A' && ch <= 'Z')
        {
            // Serial.println(ch);
            flash_morse_code(letters[ch - 'A']);
        }
        // Check for lowercase letters
        else if (ch >= 'a' && ch <= 'z')
        {
            // Serial.println(ch);
            flash_morse_code(letters[ch - 'a']);
        }
        // Check for numbers
        else if (ch >= '0' && ch <= '9')
        {
            // Serial.println(ch);
            flash_morse_code(numbers[ch - '0']);
        }
        // Check for space between words
        else if (ch == ' ')
        {
            // Put space between two words in a message...equal to seven dots
            // delay(dot_duration * 7);
            vTaskDelay(dot_duration * 7 / portTICK_PERIOD_MS);
        }
        esp_task_wdt_reset();
    }
}

long sendTimer = 0;
int btn_count = 0;
int timeHalfSec = 0;

unsigned long timeSec;

char nmea[100];
int nmea_idx = 0;
char morse[50];
uint8_t morseState = 0;

void loop()
{
    if (millis() > timeTask)
    {
        timeTask = millis() + 10000;
#if defined(TTGO_T_Beam_S3_SUPREME_V3) || defined(TTGO_T_Beam_V1_2)
        VBat = (double)PMU.getBattVoltage() / 1000;
#elif defined(HELTEC_HTIT_TRACKER)
        analogReadResolution(12);
        analogSetAttenuation(ADC_11db);
        digitalWrite(2, HIGH);
        VBat = (double)analogReadMilliVolts(1) / 201.15357F;
#elif defined(APRS_LORA_HT)
        VBat = (double)analogReadMilliVolts(3) / 595.24F;        
#elif defined(BUOY)
        // #ifdef BUOY
        VBat = (double)analogReadMilliVolts(0) / 595.24F;
        // TempNTC = getTempNTC();

        // if (WiFi.isConnected() || WiFi.softAPgetStationNum()){
        //     sprintf(morse,"B%dT%dS%dW",(int)(VBat*100),(int)(TempNTC*100),gps.satellites.value());
        //     if(WiFi.softAPgetStationNum()) strcat(morse,"A");
        //     if(WiFi.isConnected()) strcat(morse,"S");
        //     //strcat(morse," ");
        // }else{
        //     sprintf(morse," B%dT%dS%d ",(int)(VBat*100),(int)(TempNTC*100),gps.satellites.value());
        // }
        morseState++;
        if (morseState == 1)
        {
            sprintf(morse, "B%d", (int)(VBat * 100));
        }
        else if (morseState == 2)
        {
            sprintf(morse, "T%d", (int)(TempNTC * 100));
        }
        else if (morseState == 3)
        {
            sprintf(morse, "S%d", gps.satellites.value());
        }
        else if (morseState > 5)
        {
            morseState = 0;
        }
        if (morseState > 0 && morseState < 4)
            flash_morse_text(morse, strlen(morse));

        if (VBat < 3.3F)
        {
            digitalWrite(config.pwr_gpio, LOW);
            if (VBat < 3.0F)
            {
                esp_sleep_enable_timer_wakeup(600 * uS_TO_S_FACTOR);
                esp_deep_sleep_start();
            }
        }
#endif
#ifdef APRS_LORA_HT
        // VBat = (double)analogReadMilliVolts(3) / 595.24F;
        // log_d("mV=%.3f",analogReadMilliVolts(3));
#endif
        float tempCpu;
        // temp_sensor_start();
        // delay(1);
        // temp_sensor_read_celsius(&tempCpu);
        // temp_sensor_stop();
        log_d("Task process APRS=%iuS\t NETWORK=%iuS\t GPS=%iuS\t SERIAL=%iuS\t \n", timerAPRS, timerNetwork, timerGPS, timerSerial);
        log_d("Free heap: %s KB \tWiFi:%s ,RSSI:%s dBm", String((float)ESP.getFreeHeap() / 1000, 1).c_str(), String(WiFi.SSID()).c_str(), String(WiFi.RSSI()).c_str());
        // log_d("Free heap: %s KB \tWiFi:%s ,RSSI:%s dBm ,BAT: %0.3fV ,Temp: %0.2fC", String((float)ESP.getFreeHeap() / 1000, 1).c_str(), String(WiFi.SSID()).c_str(), String(WiFi.RSSI()).c_str(), VBat, TempNTC);

        if (!((WiFi.isConnected() == true) || (WiFi.softAPgetStationNum() > 0)))
        {
            Sleep_Activate &= ~ACTIVATE_WIFI;
        }

        if ((config.pwr_mode == MODE_B) && config.gnss_enable) // expand sleep delay from GPS moving
        {
            if ((gps.satellites.value() > 3) && (gps.hdop.hdop() < 5) && (gps.speed.kmph() > 10))
            {
                if (config.trk_en)
                {
                    if (config.trk_gps){
                        if(SB_SPEED > 10) StandByTick = millis() + (config.trk_slowinterval * 1000);
                    }else{
                        StandByTick = millis() + (config.trk_interval * 1000) + 1000;
                    }
                }
                else if (config.igate_en)
                {
                    if (config.igate_gps)
                        StandByTick = millis() + (config.igate_interval * 1000) + 1000;
                }
                else if (config.digi_en)
                {
                    if (config.digi_gps)
                        StandByTick = millis() + (config.digi_interval * 1000) + 1000;
                }
            }
        }
    }

#ifdef BUOY
    if (gps.location.isValid() && gps.location.isUpdated())
    {
        if (VBat > 4.1F)
            sprintf(morse, "U "); // Bat Full & GPS
        else
            sprintf(morse, "I ");
    }
    else
    {
        if (VBat > 4.1F)
            sprintf(morse, "A "); // Bat Full & NoGPS
        else
            sprintf(morse, "E ");
    }
    flash_morse_text(morse, strlen(morse));
#endif

    vTaskDelay(10 / portTICK_PERIOD_MS);

#ifdef BLUETOOTH
    if (config.bt_master)
        Bluetooth();
#endif

