nakhonthai/ESP32APRS_LoRa/src/main.cpp
#ifndef BUOY
    if (digitalRead(BOOT_PIN) == LOW)
    {
        btn_count++;
        if (btn_count > 200) // Push BOOT 10sec
        {
            btn_count = 0;
            if (curTab == 0)
            {
                showDisp = true;
                timeSec = timeHalfSec = millis();
                if (gps_mode)
                    gps_mode = false;
                else
                    gps_mode = true;
            }
        }
        else
        {
        }
    }
    else
    {
        if (btn_count > 0)
        {
            log_d("btn_count=%d", btn_count);
            if (btn_count > 25) // Push BOOT 10sec to Factory Default
            {
                // digitalWrite(LED_RX, LOW);
                // digitalWrite(LED_TX, LOW);
                // defaultConfig();
                // log_d("SYSTEM REBOOT NOW!");
                // esp_restart();
            }
            else
            {
                StandByTick = millis() + (config.pwr_stanby_delay*1000);
                showDisp = true;
                timeSec = timeHalfSec = millis();
                // if (oledSleepTimeout > 0)
                //{
                curTab++;
                if (curTab > 7)
                    curTab = 0;
                //}
            }
        }
        btn_count = 0;
    }
#endif

#if defined OLED || defined ST7735_160x80
    // Popup Display
    if (config.oled_enable == true)
    {
        if (dispBuffer.getCount() > 0)
        {
            if (millis() > timeHalfSec)
            {
                int i2c_timeout = 0;
                while (i2c_busy)
                {
                    delay(10);
                    if (++i2c_timeout > 20)
                        break;
                }
                i2c_busy = true;
                char tnc2[300];
                dispBuffer.pop(&tnc2);
                dispWindow(String(tnc2), 0, false);
                i2c_busy = false;
                timeHalfSec = millis() + (config.dispDelay * 1000);
                oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            }
        }
        else
        {
            // if (!getTransmit())
            // {
            if (queTxDisp.getCount() > 0)
            { // have tx info display
                txDisp txs;
                if (queTxDisp.pop(&txs))
                {
                    dispTxWindow(txs);
                    delay(1000);
                    // if (menuSel == 0)
                    //     curTabOld = curTab + 1;
                }
            }
            // }

            // Sleep display
            if (millis() > timeHalfSec)
            {
                if (millis() > timeSec && timeHalfSec > 0)
                {
                    timeSec = millis() + 10000;
                    showDisp = true;
                    // if(curTab<4)
                    //  curTab++;
                    //  if (curTab > 4)
                    //      curTab = 0;
                    //  timeHalfSec = 0;
                    //  oledSleepTimeout = millis() + (config.oled_timeout * 1000);
                }
                else
                {
                    if (config.oled_enable)
                    {
                        if (millis() > oledSleepTimeout && oledSleepTimeout > 0)
                        {
                            showDisp = false;
                            timeHalfSec = 0;
                            oledSleepTimeout = 0;
                            int i2c_timeout = 0;
                            while (i2c_busy)
                            {
                                delay(10);
                                if (++i2c_timeout > 20)
                                    break;
                            }
                            i2c_busy = true;
#ifdef OLED
                            display.clearDisplay();
                            display.display();
#elif defined(ST7735_160x80)
                            // digitalWrite(ST7735_LED_K_Pin, LOW);
#endif
                            i2c_busy = false;
                        }
                    }
                    else
                    {
                        showDisp = false;
                    }
                }
            }
        }

        if (showDisp)
        {
            showDisp = false;
            timeHalfSec = millis();
            // oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            switch (curTab)
            {
            case 1:
                statisticsDisp();
                timeSec = millis() + 10000;
                break;
            case 2:
                pkgLastDisp();
                timeSec = millis() + 10000;
                break;
            case 3:
                pkgCountDisp();
                timeSec = millis() + 10000;
                break;
            case 4:
                systemDisp();
                timeSec = millis() + 10000;
                break;
            case 5:
                radioDisp();
                timeSec = millis() + 10000;
                break;
            case 6:
                wifiDisp();
                timeSec = millis() + 10000;
                break;
            case 7:
                sensorDisp();
                timeSec = millis() + 10000;
                break;
            case 0:
                gpsDisp();
                timeSec = millis() + 1000;
            }
        }
    }
#endif

    // Tick one secound
    if (millis() > timeSleep)
    {
        esp_task_wdt_reset();
        timeSleep = millis() + 1000;

        if (config.pwr_en)
        {
            if (config.pwr_mode == MODE_A) // CPU and Radio active, power down control
            {
                if (millis() > StandByTick)
                {
                    log_d("System to Power down save mode %d Sec", config.pwr_sleep_interval);
                    digitalWrite(config.pwr_gpio, LOW);
#if defined(TTGO_T_Beam_S3_SUPREME_V3) || defined(TTGO_T_Beam_V1_2)
                    PMU.disableDC5();
                    PMU.disableALDO1(); //QMC6310,BME280,OLED
                    //PMU.disableALDO3(); //LoRa
                    PMU.disableBLDO2();
                    PMU.disableALDO2();
                    //PMU.disableALDO4(); //GNSS,
                    PMU.disableBLDO1(); //TF Card
                    PMU.disableDC3();
#endif
                }
                else if (millis() > (StandByTick * config.pwr_sleep_interval * 1000))
                { // Wakeup
                    StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                    digitalWrite(config.pwr_gpio, HIGH);
#if defined(TTGO_T_Beam_S3_SUPREME_V3) || defined(TTGO_T_Beam_V1_2)
                    PMU.enableDC5();
                    PMU.enableALDO1();
                    PMU.enableALDO3();
                    PMU.enableBLDO2();
                    PMU.enableALDO2();
                    PMU.enableALDO4();
                    PMU.enableBLDO1();
                    PMU.enableDC3();
#endif                    
                }
            }
            else if (config.pwr_mode == MODE_B) // Wake up and wait for delay time to sleepp
            {
#if defined(TTGO_T_Beam_S3_SUPREME_V3) || defined(TTGO_T_Beam_V1_2)                
                if(PMU.isCharging()){
                    StandByTick = millis() + (config.pwr_stanby_delay*1000);
                }
#endif                
                if (millis() > StandByTick)
                {
                    log_d("System to SLEEP Mode %d Sec", config.pwr_sleep_interval);
                    digitalWrite(config.pwr_gpio, LOW);
#if defined(TTGO_T_Beam_S3_SUPREME_V3) || defined(TTGO_T_Beam_V1_2)
                    PMU.disableDC5();
                    PMU.disableALDO1(); //QMC6310,BME280,OLED
                    //PMU.disableALDO3(); //LoRa
                    PMU.disableBLDO2();
                    PMU.disableALDO2();
                    PMU.disableALDO4(); //GNSS,
                    PMU.disableBLDO1(); //TF Card
                    PMU.disableDC3();
                    esp_sleep_enable_ext0_wakeup((gpio_num_t)PMU_IRQ, LOW);
#else
#if defined(__XTENSA__)
                    esp_sleep_enable_ext0_wakeup((gpio_num_t)config.rf_dio1_gpio, HIGH);
#else
                    //esp_sleep_enable_ext1_wakeup(0x200, ESP_EXT1_WAKEUP_ALL_LOW);
                    esp_deep_sleep_enable_gpio_wakeup((1<<config.rf_dio1_gpio), ESP_GPIO_WAKEUP_GPIO_HIGH);                   
#endif
#endif

