nakhonthai/ESP32APRS_LoRa/src/main.cpp
                    delay(100);
#ifdef __XTENSA__
                    esp_sleep_enable_ext1_wakeup(0x1, ESP_EXT1_WAKEUP_ALL_LOW);
#else
                    esp_deep_sleep_enable_gpio_wakeup((1<<9), ESP_GPIO_WAKEUP_GPIO_LOW);
#endif
                    esp_sleep_enable_timer_wakeup((uint64_t)config.pwr_sleep_interval * uS_TO_S_FACTOR);
                    esp_deep_sleep_start();
                }
            }
            else if (config.pwr_mode == MODE_C) // Wake up and wait for event to sleep
            {
                if (Sleep_Activate == ACTIVATE_OFF)
                {
                    log_d("System to SLEEP Mode %d Sec", config.pwr_sleep_interval);
                    // radioSleep();
                    // esp_deep_sleep_enable_gpio_wakeup(BIT(DEFAULT_WAKEUP_PIN), DEFAULT_WAKEUP_LEVEL));
                    digitalWrite(config.pwr_gpio, LOW);
                    // delay(100);
                    // esp_sleep_enable_ext0_wakeup(GPIO_NUM_14,LOW);
                    radioSleep();
#if defined(TTGO_T_Beam_S3_SUPREME_V3) || defined(TTGO_T_Beam_V1_2)
                    PMU.disableDC5();
                    PMU.disableALDO1();
                    PMU.disableALDO3();
                    PMU.disableBLDO2();
                    PMU.disableALDO2();
                    PMU.disableALDO4();
                    PMU.disableBLDO1();
                    PMU.disableDC3();
#else
#if defined(__XTENSA__)
                    esp_sleep_enable_ext0_wakeup((gpio_num_t)config.rf_dio1_gpio, HIGH);
#else
                    //esp_sleep_enable_ext1_wakeup(0x200, ESP_EXT1_WAKEUP_ALL_LOW);
                    esp_deep_sleep_enable_gpio_wakeup((1<<config.rf_dio1_gpio), ESP_GPIO_WAKEUP_GPIO_HIGH);                   
#endif
#endif

                    delay(100);
#ifdef __XTENSA__
                    esp_sleep_enable_ext1_wakeup(0x1, ESP_EXT1_WAKEUP_ALL_LOW);
#else
                    esp_deep_sleep_enable_gpio_wakeup((1<<9), ESP_GPIO_WAKEUP_GPIO_LOW);
#endif
                    esp_sleep_enable_timer_wakeup((uint64_t)config.pwr_sleep_interval * uS_TO_S_FACTOR);
                    esp_deep_sleep_start();
                }
            }
        }
        if (ESP.getFreeHeap() < 60000)
            esp_restart();
        // Serial.println(String(ESP.getFreeHeap()));
    }
}

String sendIsAckMsg(String toCallSign, int msgId)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    strcpy(&call[0], toCallSign.c_str());
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;
    memset(&str[0], 0, 300);

    sprintf(str, "%s-%d>APE32L%s::%s:ack%d", config.aprs_mycall, config.aprs_ssid, VERSION, call, msgId);
    //	client.println(str);
    return String(str);
}

void sendIsPkg(char *raw)
{
    char str[300];
    sprintf(str, "%s-%d>APE32L%s:%s", config.aprs_mycall, config.aprs_ssid, VERSION, raw);
    // client.println(str);
    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    if (config.digi_en)
        pkgTxPush(str, strlen(str), 0);
}

void sendIsPkgMsg(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (config.aprs_ssid == 0)
        sprintf(call, "%s", config.aprs_mycall);
    else
        sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (config.aprs_ssid == 0)
        sprintf(str, "%s>APE32L::%s:%s", config.aprs_mycall, call, raw);
    else
        sprintf(str, "%s-%d>APE32L::%s:%s", config.aprs_mycall, config.aprs_ssid, call, raw);

    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    // if (config.tnc && config.tnc_digi)
    //     pkgTxUpdate(str, 0);
    // APRS_sendTNC2Pkt(tnc2Raw); // Send packet to RF
}

void sendTelemetry_0(char *raw, bool header)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (strlen(config.trk_item) > 3)
    {
        sprintf(call, "%s", config.trk_item);
    }
    else
    {
        if (config.tlm0_ssid == 0)
            sprintf(call, "%s", config.tlm0_mycall);
        else
            sprintf(call, "%s-%d", config.tlm0_mycall, config.tlm0_ssid);
    }
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (header)
    {
        if (config.tlm0_ssid == 0)
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s>APE32L-%d::%s:%s ", config.tlm0_mycall, config.tlm0_path, call, raw);
                else
                    sprintf(str, "%s>APE32L::%s:%s ", config.tlm0_mycall, call, raw);
            }
            else
            {
                sprintf(str, "%s>APE32L,%s::%s:%s ", config.tlm0_mycall, getPath(config.tlm0_path).c_str(), call, raw);
            }
        }
        else
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s-%d>APE32L-%d::%s:%s ", config.tlm0_mycall, config.tlm0_ssid, config.tlm0_path, call, raw);
                else
                    sprintf(str, "%s-%d>APE32L::%s:%s ", config.tlm0_mycall, config.tlm0_ssid, call, raw);
            }
            else
            {
                sprintf(str, "%s-%d>APE32L,%s::%s:%s ", config.tlm0_mycall, config.tlm0_ssid, getPath(config.tlm0_path).c_str(), call, raw);
            }
        }
    }
    else
    {
        if (config.tlm0_ssid == 0)
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s>APE32L-%d:%s", config.tlm0_mycall, config.tlm0_path, raw);
                else
                    sprintf(str, "%s>APE32L:%s", config.tlm0_mycall, raw);
            }
            else
            {
                sprintf(str, "%s>APE32L,%s:%s", config.tlm0_mycall, getPath(config.tlm0_path).c_str(), raw);
            }
        }
        else
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s-%d>APE32L-%d:%s", config.tlm0_mycall, config.tlm0_ssid, config.tlm0_path, raw);
                else
                    sprintf(str, "%s-%d>APE32L:%s", config.tlm0_mycall, config.tlm0_ssid, raw);
            }
            else
            {
                sprintf(str, "%s-%d>APE32L,%s:%s", config.tlm0_mycall, config.tlm0_ssid, getPath(config.tlm0_path).c_str(), raw);
            }
        }
    }

    if (config.tlm0_2rf)
    { // TLM SEND TO RF
        // char *rawP = (char *)malloc(rawData.length());
        //  rawData.toCharArray(rawP, rawData.length());
        // memcpy(rawP, rawData.c_str(), rawData.length());
        pkgTxPush(str, strlen(str), 0);
        // pushTxDisp(TXCH_RF, "TX DIGI POS", sts);
        // free(rawP);
    }
    if (config.tlm0_2inet)
    { // TLM SEND TO APRS-IS
        if (aprsClient.connected())
        {
            status.txCount++;
            aprsClient.printf("%s\r\n", str); // Send packet to Inet
            // pushTxDisp(TXCH_TCP, "TX DIGI POS", sts);
        }
    }
}

void sendTelemetry_trk(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (strlen(config.trk_item) > 3)
    {
        sprintf(call, "%s", config.trk_item);
    }
    else
    {
        if (config.trk_ssid == 0)
            sprintf(call, "%s", config.trk_mycall);
        else
            sprintf(call, "%s-%d", config.trk_mycall, config.trk_ssid);
    }
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (config.trk_ssid == 0)
    {
        if (config.trk_path < 5)
        {
            if (config.trk_path > 0)
                sprintf(str, "%s>APE32L-%d::%s:%s ", config.trk_mycall, config.trk_path, call, raw);
            else
                sprintf(str, "%s>APE32L::%s:%s ", config.trk_mycall, call, raw);
        }
        else
        {
            sprintf(str, "%s>APE32L,%s::%s:%s ", config.trk_mycall, getPath(config.trk_path).c_str(), call, raw);
        }
    }
    else
    {
        if (config.trk_path < 5)
        {
            if (config.trk_path > 0)
                sprintf(str, "%s-%d>APE32L-%d::%s:%s ", config.trk_mycall, config.trk_ssid, config.trk_path, call, raw);
            else
                sprintf(str, "%s-%d>APE32L::%s:%s ", config.trk_mycall, config.trk_ssid, call, raw);
        }
        else
        {
            sprintf(str, "%s-%d>APE32L,%s::%s:%s ", config.trk_mycall, config.trk_ssid, getPath(config.trk_path).c_str(), call, raw);
        }
    }

    if (config.trk_loc2rf)
    { // TLM SEND TO RF
        pkgTxPush(str, strlen(str), 0);
    }
    if (config.trk_loc2inet)
    { // TLM SEND TO APRS-IS
        if (aprsClient.connected())
        {
            status.txCount++;
            aprsClient.printf("%s\r\n", str); // Send packet to Inet
            delay(2000);
        }
    }
}

void sendTelemetry_igate(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (strlen(config.igate_object) > 3)
    {
        sprintf(call, "%s", config.igate_object);
    }
    else
    {
        if (config.aprs_ssid == 0)
            sprintf(call, "%s", config.aprs_mycall);
        else
            sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    }
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

