nakhonthai/ESP32APRS_LoRa/src/main.cpp
                if (config.trk_rssi)
                {
                    cmn += " ?RSSI";
                }
                
                if (config.trk_gps) // TRACKER by GPS
                {
                    rawData = trk_gps_postion(cmn);
                    if (config.log & LOG_TRACKER)
                    {
                        logTracker(gps.location.lat(), gps.location.lng(), gps.speed.kmph(), gps.course.deg());
                    }
                }
                else // TRACKER by FIX position
                {
                    rawData = trk_fix_position(cmn);
                    if (config.log & LOG_TRACKER)
                    {
                        logTracker(config.trk_lat, config.trk_lon, 0, 0);
                    }
                }

                log_d("TRACKER RAW: %s\n", rawData.c_str());
                log_d("TRACKER EVENT_TX_POSITION=%d\t INTERVAL=%d\n", EVENT_TX_POSITION, tx_interval);
                tx_counter = 0;
                EVENT_TX_POSITION = 0;
                last_heading = SB_HEADING;
#if defined OLED || defined ST7735_160x80
                if (config.trk_gps)
                {
                    // if (gps.location.isValid() && (gps.hdop.hdop() < 10.0))
                    sprintf(sts, "POSITION GPS\nSPD %dkPh/%d\nINTERVAL %ds", SB_SPEED, SB_HEADING, tx_interval);
                    // else
                    //     sprintf(sts, "POSITION GPS\nGPS INVALID\nINTERVAL %ds", tx_interval);
                }
                else
                {
                    sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);
                }
                char name[12];
                if (strlen(config.trk_item) > 3)
                {
                    sprintf(name, "%s", config.trk_item);
                }
                else
                {
                    if (config.trk_ssid > 0)
                        sprintf(name, "%s-%d", config.trk_mycall, config.trk_ssid);
                    else
                        sprintf(name, "%s", config.trk_mycall);
                }
#endif
                if (config.trk_loc2rf)
                { // TRACKER SEND TO RF
                    char *rawP = (char *)calloc(rawData.length(), sizeof(char));
                    memcpy(rawP, rawData.c_str(), rawData.length());
                    // rawData.toCharArray(rawP, rawData.length());
                    pkgTxPush(rawP, rawData.length(), 0);

#if defined OLED || defined ST7735_160x80
                    pushTxDisp(TXCH_RF, name, sts);
#endif
                    free(rawP);
                }
                if (config.trk_loc2inet)
                { // TRACKER SEND TO APRS-IS
                    if (aprsClient.connected())
                    {
                        aprsClient.println(rawData); // Send packet to Inet
#if defined OLED || defined ST7735_160x80
                        // pushTxDisp(TXCH_TCP, "TX TRACKER", sts);
#endif
                    }
                }
                rawData.clear();
                cmn.clear();
            }
        }

        // LOAD DATA incomming
        bool newIGatePkg = false;
        bool newDigiPkg = false;
        if (PacketBuffer.getCount() > 0)
        {
            String tnc2 = "";
            // นำข้อมูลแพ็จเกจจาก TNC ออกจากคิว
            PacketBuffer.pop(&incomingPacket);
            // igateProcess(incomingPacket);
            packet2Raw(tnc2, incomingPacket);
            newIGatePkg = true;
            newDigiPkg = true;
            if (config.ext_tnc_enable)
            {
                if (config.ext_tnc_channel > 0 && config.ext_tnc_channel < 3)
                {
                    if (config.ext_tnc_mode == 1)
                    {
                        // KISS MODE
                        uint8_t pkg[500];
                        int sz = kiss_wrapper(pkg);
                        if (config.ext_tnc_channel == 1)
                        {
#if ARDUINO_USB_CDC_ON_BOOT
                            Serial0.write(pkg, sz);
#else
                            Serial.write(pkg, sz);
#endif
                        }
                        else if (config.ext_tnc_channel == 2)
                        {
                            Serial1.write(pkg, sz);
                        }
                        else if (config.ext_tnc_channel == 3)
                        {
                            // Serial2.write(pkg, sz);
                        }
                    }
                    else if (config.ext_tnc_mode == 2)
                    {
                        // TNC2
                        if (config.ext_tnc_channel == 1)
                        {
#if ARDUINO_USB_CDC_ON_BOOT
                            Serial0.println(tnc2);
#else
                            Serial.println(tnc2);
#endif
                        }
                        else if (config.ext_tnc_channel == 2)
                        {
                            Serial1.println(tnc2);
                        }
                        else if (config.ext_tnc_channel == 3)
                        {
                            // Serial2.println(tnc2);
                        }
                    }
                }
            }
#ifdef BLUETOOTH
            if (config.bt_master)
            { // Output TNC2RAW to BT Serial
              // SerialBT.println(tnc2);
                if (config.bt_mode == 1)
                {
                    char *rawP = (char *)malloc(tnc2.length());
                    memcpy(rawP, tnc2.c_str(), tnc2.length());
                    SerialBT.write((uint8_t *)rawP, tnc2.length());
                    // pTxCharacteristic->setValue((uint8_t *)rawP, tnc2.length());
                    // pTxCharacteristic->notify();
                    free(rawP);
                }
                else if (config.bt_mode == 2)
                { // KISS
                    uint8_t pkg[500];
                    int sz = kiss_wrapper(pkg);
                    SerialBT.write(pkg, sz);
                    // pTxCharacteristic->setValue(pkg, sz);
                    // pTxCharacteristic->notify();
                }
            }
#endif
            log_d("RX: %s", tnc2.c_str());

            // SerialBT.println(tnc2);
            uint16_t type = pkgType((char *)incomingPacket.info);
            char call[11];
            if (incomingPacket.src.ssid > 0)
                sprintf(call, "%s-%d", incomingPacket.src.call, incomingPacket.src.ssid);
            else
                sprintf(call, "%s", incomingPacket.src.call);

            char *rawP = (char *)calloc(tnc2.length(), sizeof(char));
            if (rawP)
            {
                memset(rawP, 0, tnc2.length());
                tnc2.toCharArray(rawP, tnc2.length(), 0);
                // memcpy(rawP, tnc2.c_str(), tnc2.length());
                int idx = pkgListUpdate(call, rawP, type, 0);

#if defined OLED || defined ST7735_160x80
                if (idx > -1)
                {

                    if (config.rx_display && config.dispRF && (type & config.dispFilter))
                    {
                        dispBuffer.push(tnc2.c_str());
                        log_d("RF_putQueueDisp:[pkgList_idx=%d,Type=%d] %s\n", idx, type, call);
                    }
                }
#endif
                free(rawP);
            }
            lastPkg = true;
            lastPkgRaw = tnc2;
            handle_ws();
            // ESP_BT.println(tnc2);
            status.allCount++;
            tnc2.clear();
        }

        // IGate Process
        if (config.igate_en)
        {
            // IGATE Position
            if (config.igate_bcn)
            {
                if (millis() > iGatetickInterval)
                {

                    String rawData = "";
                    if (config.igate_gps)
                    { // IGATE Send GPS position
                        if (gps.location.isValid()){
                            rawData = igate_position(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
                            if (config.log & LOG_IGATE)
                            {
                                logIGate(gps.location.lat(), gps.location.lng(), gps.speed.kmph(), gps.course.deg());
                            }
                        }
                    }
                    else
                    { // IGATE Send fix position
                        rawData = igate_position(config.igate_lat, config.igate_lon, config.igate_alt, "");
                         if (config.log & LOG_TRACKER)
                        {
                            logIGate(config.igate_lat, config.igate_lon, 0, 0);
                        }
                    }
                    if (rawData != "")
                    {
                        iGatetickInterval = millis() + (config.igate_interval * 1000);

                        if (config.igate_tlm_sensor[0] | config.igate_tlm_sensor[1] | config.igate_tlm_sensor[2] | config.igate_tlm_sensor[3] | config.igate_tlm_sensor[4])
                        {
                            char tlm_result[100];
                            char tlm_data[200];
                            size_t tlm_sz;
                            if (IGATE_TLM_SEQ == 0)
                            {
                                char rawInfo[100];
                                char name[10];
                                sprintf(rawInfo, "PARM.");
                                int i, c = 0;
                                for (i = 0; i < 5; i++)
                                {
                                    if (config.igate_tlm_sensor[i] == 0)
                                    {
                                        c++;
                                        continue;
                                    }
                                    else
                                    {
                                        if (i > 0)
                                            strcat(rawInfo, ",");
                                        sprintf(name, "%s", config.igate_tlm_PARM[i]);
                                        strcat(rawInfo, name);
                                    }
                                }
                                for (int n = c + 8; n > 0; n--)
                                {
                                    strcat(rawInfo, ",");
                                }
                                sendTelemetry_igate(rawInfo);
                                memset(rawInfo, 0, sizeof(rawInfo));
                                sprintf(rawInfo, "UNIT.");
                                c = 0;
                                for (i = 0; i < 5; i++)
                                {
                                    if (config.igate_tlm_sensor[i] == 0)
                                    {
                                        c++;
                                        continue;
                                    }
                                    else
                                    {
                                        if (i > 0)
                                            strcat(rawInfo, ",");
                                        sprintf(name, "%s", config.igate_tlm_UNIT[i]);
                                        strcat(rawInfo, name);
                                    }
                                }
                                for (int n = c + 8; n > 0; n--)
                                {
                                    strcat(rawInfo, ",");
                                }
                                sendTelemetry_igate(rawInfo);
                                memset(rawInfo, 0, sizeof(rawInfo));
                                sprintf(rawInfo, "EQNS.");
                                c = 0;
                                for (i = 0; i < 5; i++)
                                {
                                    if (config.igate_tlm_sensor[i] == 0)
                                    {
                                        c++;
                                        continue;
                                    }
                                    else
                                    {
                                        if (i > 0)
                                            strcat(rawInfo, ",");
                                        if (fmod(config.igate_tlm_EQNS[i][0], 1) == 0)
                                            sprintf(name, "%0.f", config.igate_tlm_EQNS[i][0]);
                                        else
                                            sprintf(name, "%.3f", config.igate_tlm_EQNS[i][0]);
                                        strcat(rawInfo, name);
                                        if (fmod(config.igate_tlm_EQNS[i][1], 1) == 0)
                                            sprintf(name, ",%0.f", config.igate_tlm_EQNS[i][1]);
                                        else
                                            sprintf(name, ",%.3f", config.igate_tlm_EQNS[i][1]);
                                        strcat(rawInfo, name);
                                        if (fmod(config.igate_tlm_EQNS[i][2], 1) == 0)
                                            sprintf(name, ",%0.f", config.igate_tlm_EQNS[i][2]);
                                        else
                                            sprintf(name, ",%.3f", config.igate_tlm_EQNS[i][2]);
                                        strcat(rawInfo, name);
                                    }
                                }
                                for (int n = c; n > 0; n--)
                                {
                                    strcat(rawInfo, ",");
                                    sprintf(name, "0");
                                    strcat(rawInfo, name);
                                    sprintf(name, ",1");
                                    strcat(rawInfo, name);
                                    sprintf(name, ",0");
                                    strcat(rawInfo, name);
                                }
                                // strcat(rawInfo, ",");
                                sendTelemetry_igate(rawInfo);
                            }

