nakhonthai/ESP32APRS_LoRa/src/main.cpp
    display.setCursor(10, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("RADIO Info");
    display.setFont();
    display.setCursor(119, 7);
    display.print("5");
    display.setTextColor(WHITE);

    display.setCursor(3, 18);
    display.print("Frequency");
    str = String(config.rf_freq, 3) + " MHz";
    x = str.length() * 6;
    display.setCursor(126 - x, 18);
    display.print(str);

    display.setCursor(3, 26);
    display.print("Bandwidth");
    str = String(config.rf_bw, 2) + " Khz";
    x = str.length() * 6;
    display.setCursor(126 - x, 26);
    display.print(str);

    display.setCursor(3, 35);
    display.print("Spread Factor");
    str = String(config.rf_sf);
    x = str.length() * 6;
    display.setCursor(126 - x, 35);
    display.print(str);

    display.setCursor(3, 44);
    display.print("Coding Rate");
    str = String(config.rf_cr);
    x = str.length() * 6;
    display.setCursor(126 - x, 44);
    display.print(str);

    display.setCursor(3, 53);
    display.print("TX Power");
    // str = "V" + String(VERSION);
    if (config.rf_power >= 0)
        str = "+" + String(config.rf_power) + " dBm";
    else
        str = "-" + String(config.rf_power) + " dBm";
    x = str.length() * 6;
    display.setCursor(126 - x, 53);
    display.print(str);

    display.display();
#elif defined(ST7735_160x80)
    display.fillRect(0, 0, 160, 15, WHITE);
    display.drawRect(0, 16, 160, 64, WHITE);
    display.fillRect(1, 17, 158, 62, BLACK);

    display.setCursor(25, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("RADIO Info");
    display.setFont();
    display.setCursor(150, 7);
    display.print("5");
    display.setTextColor(WHITE);

    display.setCursor(3, 18);
    display.print("Frequency");
    str = String(config.rf_freq, 3) + " MHz";
    x = str.length() * 6;
    display.setCursor(158 - x, 18);
    display.print(str);

    display.setCursor(3, 28);
    display.print("Bandwidth");
    str = String(config.rf_bw, 2) + " Khz";
    x = str.length() * 6;
    display.setCursor(158 - x, 28);
    display.print(str);

    display.setCursor(3, 38);
    display.print("Spread Factor");
    str = String(config.rf_sf);
    x = str.length() * 6;
    display.setCursor(158 - x, 38);
    display.print(str);

    display.setCursor(3, 48);
    display.print("Coding Rate");
    str = String(config.rf_cr);
    x = str.length() * 6;
    display.setCursor(158 - x, 48);
    display.print(str);

    display.setCursor(3, 58);
    display.print("TX Power");
    if (config.rf_power >= 0)
        str = "+" + String(config.rf_power) + " dBm";
    else
        str = "-" + String(config.rf_power) + " dBm";
    x = str.length() * 6;
    display.setCursor(158 - x, 58);
    display.print(str);
#endif
}

void sensorDisp()
{

    // uint8 wifi = 0, k = 0, l;
    uint k = 0;
    int i;
    // char list[4];
    int x, y;
    String str;
    // String times;
    // pkgListType *ptr[100];
#ifdef OLED
    display.fillRect(0, 0, 128, 15, WHITE);
    display.drawRect(0, 16, 128, 48, WHITE);
    display.fillRect(1, 17, 126, 46, BLACK);

    display.setCursor(20, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("SENSOR");
    display.setFont();
    display.setCursor(119, 7);
    display.print("7");
    display.setTextColor(WHITE);

    for (i = 0; i < 10; i++)
    {
        if (config.sensor[i].enable)
        {
            y = 18 + (k * 9);
            if (++k > 5)
                break;
            display.setTextColor(WHITE);
            display.setCursor(2, y);
            display.print(String(config.sensor[i].parm).substring(0, 12));
            str = String(sen[i].sample, 2) + String(config.sensor[i].unit);
            x = str.length() * 6;
            display.setCursor(126 - x, y);
            display.print(str);
        }
    }

    display.display();
#elif defined(ST7735_160x80)
    display.fillRect(0, 0, 160, 15, WHITE);
    display.drawRect(0, 16, 160, 64, WHITE);
    display.fillRect(1, 17, 158, 62, BLACK);

    display.setCursor(35, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("SENSOR");
    display.setFont();
    display.setCursor(150, 7);
    display.print("7");
    display.setTextColor(WHITE);

    for (i = 0; i < 10; i++)
    {
        if (config.sensor[i].enable)
        {
            y = 18 + (k * 9);
            if (++k > 6)
                break;
            display.setTextColor(WHITE);
            display.setCursor(2, y);
            display.print(String(config.sensor[i].parm).substring(0, 15));
            str = String(sen[i].sample, 2) + String(config.sensor[i].unit);
            x = str.length() * 6;
            display.setCursor(158 - x, y);
            display.print(str);
        }
    }
#endif
}

void gpsDisp()
{
    int x;
    String str;

#ifdef OLED
    if (gps_mode == 0)
    {
        display.fillRect(0, 0, 128, 15, WHITE);
        display.drawRect(0, 16, 128, 48, WHITE);
        display.fillRect(1, 17, 126, 46, BLACK);

        display.setCursor(20, 7);
        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);
        display.setTextColor(BLACK);

        // display.fillRect(0, 16, 128, 10, WHITE);
        // display.drawLine(0, 16, 0, 63, WHITE);
        // display.drawLine(127, 16, 127, 63, WHITE);
        // display.drawLine(0, 63, 127, 63, WHITE);
        // display.fillRect(1, 25, 126, 38, BLACK);
        // display.setTextColor(BLACK);
        // display.setCursor(35, 17);
        display.print("GPS INFO");
        display.setCursor(119, 17);
        display.print("0");
        display.setTextColor(WHITE);
        display.setFont();

        display.setCursor(3, 18);
        display.print("LAT:");
        str = String(gps.location.lat(), 5);
        x = str.length() * 6;
        display.setCursor(80 - x, 18);
        display.print(str);

        display.setCursor(3, 26);
        display.print("LON:");
        str = String(gps.location.lng(), 5);
        x = str.length() * 6;
        display.setCursor(80 - x, 26);
        display.print(str);

